Revit 2026 API

# DocumentGetCloudFolderId Method

---

Gets ForgeDM folder id where the model locates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetCloudFolderId(
	bool forceRefresh
)
```
```vb
Public Function GetCloudFolderId (
	forceRefresh As Boolean
) As String
```
```cpp
public:
String^ GetCloudFolderId(
	bool forceRefresh
)
```
```fsharp
member GetCloudFolderId :
        forceRefresh : bool -> string
```

#### Parameters

forceRefresh Boolean
     Cached value will be refreshed by sending a service call when forceRefresh is true.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| RevitServerUnauthorizedException | Thrown when cannot get data from ForgeDM for Revit cloud model. |

It is empty for non-cloud model; It is cached in Revit model opened session after getting it if forceRefresh is false; ForgeDM folder id can be changed during Revit model opened session, set forceRefresh as 'true' to get new value.

#### Reference

Document Class

Autodesk.Revit.DB Namespace